org/jekyll/_posts/2026-03-27-self-documenting-code.html
---
layout: post.liquid
title:  "Software Malpractice: The Fallacy of Self-Documenting Code"
date: 2026-03-27
last_updated: 2026-03-27
tags:
  - software
  - malpractice
  - documentation
  - intent
categories: [software]
permalink: /2026-03-27-self-documenting-code
toc: true
---

<p>
There is a belief among software engineers that code can document
itself. The idea is comforting: if you name things well, keep
functions short, and structure your logic clearly, the code will speak
for itself. No comments needed. No external documentation. The code is
the documentation.
</p>

<p>
I used to find this convincing. I don't anymore.
</p>
<div id="outline-container-the-belief" class="outline-2">
<h2 id="the-belief"><span class="section-number-2">1.</span> The belief</h2>
<div class="outline-text-2" id="text-the-belief">
<p>
When engineers say "self-documenting code," they usually mean
something like this: readable code with good naming conventions,
small functions with clear responsibilities, and minimal or no
comments. The reasoning is that comments go stale, but code is
always up to date. So the code should be the single source of
truth.
</p>

<p>
There is real value in this. Readable code is easier to work with
than unreadable code. Good naming helps. Small functions help. None
of that is wrong.
</p>

<p>
But there is a quiet assumption hiding underneath: that if you can
read what the code does, you also know what it is supposed to do.
That assumption is where things fall apart.
</p>
</div>
</div>
<div id="outline-container-what-code-tells-you" class="outline-2">
<h2 id="what-code-tells-you"><span class="section-number-2">2.</span> What code can and cannot tell you</h2>
<div class="outline-text-2" id="text-what-code-tells-you">
<p>
Code describes what it does. It can tell you that a function takes
two numbers and returns their sum. It can tell you that a loop
iterates over a list and filters out entries matching some
condition. It can tell you the exact sequence of operations that
will execute at runtime.
</p>

<p>
What it cannot tell you is whether any of that is correct.
</p>

<p>
Correctness is not a property of code in isolation. It is a
relationship between the code and something external to it: the
intent. What was this supposed to do? What problem was it meant to
solve? For whom? Under what circumstances?
</p>

<p>
Code is an interpretation of intent. It is not the intent itself.
</p>
</div>
</div>
<div id="outline-container-the-car" class="outline-2">
<h2 id="the-car"><span class="section-number-2">3.</span> The car</h2>
<div class="outline-text-2" id="text-the-car">
<p>
Consider the requirement: "write a program that models a car."
</p>

<p>
One engineer builds a model with parts: engine, wheels, chassis,
doors. The model captures the structure of a car. It would work well
for a sales catalog or a parts inventory system.
</p>

<p>
Another engineer builds a model with behaviors: accelerate, brake,
steer, shift gears. This model captures what a car does. It would
work well for a driving simulation.
</p>

<p>
Both implementations are clean. Both have good names, clear
structure, small functions. Both are, by any reasonable standard,
"self-documenting." And both are completely correct — for different
intents.
</p>

<p>
If you only have the code, you cannot tell which one is right. You
might not even realize there is a question to ask. A confident
engineer could build the wrong system and never notice, because the
code reads perfectly well.
</p>
</div>
</div>
<div id="outline-container-the-missing-piece" class="outline-2">
<h2 id="the-missing-piece"><span class="section-number-2">4.</span> The missing piece</h2>
<div class="outline-text-2" id="text-the-missing-piece">
<p>
Intent is the purpose behind the code. It answers questions like:
what problem are we solving, who has this problem, and how will we
know we solved it?
</p>

<p>
You cannot derive intent from code. You can read the code and
understand what it does, but you cannot reconstruct why it was
written that way, or whether the approach was the right one. The
code is a finished product. The reasoning that led to it is not
embedded in the artifact.
</p>

<p>
This is the core of the fallacy: treating the artifact as if it
contains the reasoning. It doesn't.
</p>
</div>
</div>
<div id="outline-container-the-fallacy-spreads" class="outline-2">
<h2 id="the-fallacy-spreads"><span class="section-number-2">5.</span> The fallacy spreads</h2>
<div class="outline-text-2" id="text-the-fallacy-spreads">
<p>
The same pattern shows up in other places.
</p>

<p>
Tests written after the implementation tend to mirror the code they
are testing. They verify that the code does what the code does. This
is circular. A test that says "the function returns 42" is only
useful if you know that 42 is the right answer. Without intent, the
test is a tautology.
</p>

<p>
Commit messages often describe what changed but not why. "Refactored
user service" or "updated validation logic" tells you what happened
in the code. It does not tell you what motivated the change, what
problem it addressed, or what trade-offs were considered. Six months
later, the commit is a fact without context.
</p>

<p>
Code reviews suffer from the same gap. A reviewer can check whether
the code is clean, whether it follows conventions, whether there are
obvious bugs. But without knowing the intent, the reviewer cannot
assess whether the code solves the right problem. The review becomes
a style check.
</p>
</div>
</div>
<div id="outline-container-specifications" class="outline-2">
<h2 id="specifications"><span class="section-number-2">6.</span> Specifications are not immune</h2>
<div class="outline-text-2" id="text-specifications">
<p>
You might think that specifications capture intent. Sometimes they
do. But in practice, specifications often describe solutions rather
than problems.
</p>

<p>
"Implement a car model with the following attributes: engine, wheels,
chassis, doors." That is not intent. That is a design decision
already made. The specification has absorbed the interpretation and
presents it as if it were the requirement.
</p>

<p>
The same fallacy applies: the artifact is mistaken for the
reasoning. A specification that describes a solution without
explaining the problem it solves is just code written in prose.
</p>
</div>
</div>
<div id="outline-container-requirements-without-intent" class="outline-2">
<h2 id="requirements-without-intent"><span class="section-number-2">7.</span> Requirements without intent</h2>
<div class="outline-text-2" id="text-requirements-without-intent">
<p>
In larger organizations, there are often several layers between the
people who have the problem and the people who write the code.
Product managers talk to stakeholders, write requirements, hand them
to architects, who produce designs, which are passed to development
teams.
</p>

<p>
At each step, the original problem gets translated. And at each
translation, some intent is lost and some interpretation is added.
By the time the requirements reach the engineers, they often look
like solutions. The engineers implement them faithfully. The code is
clean. The tests pass. The system ships.
</p>

<p>
And sometimes nobody uses it. Or it solves a problem that nobody
actually had. Not because the engineers were incompetent, but
because the intent was lost somewhere in the chain.
</p>
</div>
</div>
<div id="outline-container-why-this-persists" class="outline-2">
<h2 id="why-this-persists"><span class="section-number-2">8.</span> Why this persists</h2>
<div class="outline-text-2" id="text-why-this-persists">
<p>
Software practices vary widely. Not every team has the luxury of
direct access to users. Not every organization enforces clear
documentation of intent. Under time pressure, the artifact becomes
the deliverable and the reasoning behind it is treated as overhead.
</p>

<p>
Writing down intent takes effort. It requires understanding the
problem well enough to articulate it, which is harder than it
sounds. It is easier to write code that works than to explain why it
should work that way.
</p>

<p>
So the fallacy persists not because people are careless, but because
the conditions make it easy to skip the hard part.
</p>
</div>
</div>
<div id="outline-container-what-to-do" class="outline-2">
<h2 id="what-to-do"><span class="section-number-2">9.</span> What to do about it</h2>
<div class="outline-text-2" id="text-what-to-do">
<p>
Code is not the source of truth for intent. It never was. Readable
code is valuable, but it is not sufficient. The artifacts we produce
— code, tests, commits, specs — need to be complemented by explicit
explanations of why they exist.
</p>

<p>
This does not mean writing novels in comments. It means answering a
few questions and making the answers visible: what problem are we
solving, for whom, and how will we know it worked?
</p>

<p>
The format matters less than the habit. A sentence in a commit
message. A paragraph at the top of a specification. A comment that
explains a non-obvious decision. These small acts of documentation
are what connect the artifact to its purpose.
</p>
</div>
</div>
<div id="outline-container-closing" class="outline-2">
<h2 id="closing"><span class="section-number-2">10.</span> Closing thought</h2>
<div class="outline-text-2" id="text-closing">
<p>
Code can explain itself. It cannot justify itself.
</p>

<p>
Without intent, correctness is undefined. And if correctness is
undefined, it does not matter how clean the code is.
</p>

<p>
This is the first entry in what I am calling Software
Malpractice. Not because I think engineers are negligent, but
because some of our most cherished practices deserve a closer look.
</p>
</div>
</div>
